20241104T143835--kdoc-272-バイトコード変換は型情報が必須ではない__permanent.org
:properties:
:ID: 20241104T143835
:mtime:    20241115172747
:ctime:    20241104143844
:end:
#+title:      KDOC 272: バイトコード変換は型情報が必須ではない
#+date:       [2024-11-04 Mon 14:38]
#+filetags:   :permanent:
#+identifier: 20241104T143835

* この文書のステータス
- 作成
  - [X] 2024-11-04 貴島
- レビュー
  - [X] 2024-11-08 貴島

* 概要

バイトコードは定義からいって中間表現(仮想マシンの機械語)であり、CPUが直接解釈するわけでない。抽象化されており、番地まで指定してのメモリ操作などは行わない。したがって具体的なメモリサイズを考える必要がない。

ということは詳細な型情報がなくてもバイトコードに変換できるということである。したがって動的型付けの言語で、速度で有利なバイトコードにコンパイルすることが多い。

* 関連
- [[id:20241104T091512][KDOC 270: 動的型付け言語ではなぜバイトコードにコンパイルすることが多いか]]。疑問を考えた
