20241104T143835--kdoc-272-バイトコード変換は型情報が必須ではない__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 272: バイトコード変換は型情報が必須ではない</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../roam/css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 272: バイトコード変換は型情報が必須ではない</h1>

<div id="outline-container-org2aac32a" class="outline-2">
<h2 id="org2aac32a"><a href="#org2aac32a">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2aac32a">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-04 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-08 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf4c016" class="outline-2">
<h2 id="orgaf4c016"><a href="#orgaf4c016">概要</a></h2>
<div class="outline-text-2" id="text-orgaf4c016">
<p>
バイトコードは定義からいって中間表現であり、CPUが直接解釈するわけでない。抽象化されており、番地まで指定してのメモリ操作などは行わない。したがって具体的なメモリサイズを考える必要がない。
</p>

<p>
ということは詳細な型情報がなくてもバイトコードに変換できるということである。したがって動的型付けの言語で、速度で有利なバイトコードにコンパイルすることが多い。
</p>
</div>
</div>

<div id="outline-container-org1198e83" class="outline-2">
<h2 id="org1198e83"><a href="#org1198e83">関連</a></h2>
<div class="outline-text-2" id="text-org1198e83">
<ul class="org-ul">
<li><a href="20241104T091512--kdoc-270-動的型付け言語ではなぜバイトコードにコンパイルすることが多いか__permanent.html#ID-20241104T091512">KDOC 270: 動的型付け言語ではなぜバイトコードにコンパイルすることが多いか</a>。疑問を考えた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
